{"format": "layers-model", "generatedBy": "keras v2.13.1", "convertedBy": "TensorFlow.js Converter v4.11.0", "modelTopology": {"keras_version": "2.13.1", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "SiameseNetwork", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 100, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_img"}, "name": "input_img", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 100, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "validation_img"}, "name": "validation_img", "inbound_nodes": []}, {"class_name": "Functional", "config": {"name": "embedding", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 100, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_image"}, "name": "input_image", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "first_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [10, 10], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "first_conv", "inbound_nodes": [[["input_image", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "trainable": true, "dtype": "float32", "pool_size": [64, 64], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_6", "inbound_nodes": [[["first_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "second_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "second_conv", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_7", "trainable": true, "dtype": "float32", "pool_size": [64, 64], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_7", "inbound_nodes": [[["second_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "third_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "third_conv", "inbound_nodes": [[["max_pooling2d_7", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_8", "trainable": true, "dtype": "float32", "pool_size": [64, 64], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_8", "inbound_nodes": [[["third_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "fourth_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [4, 4], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fourth_conv", "inbound_nodes": [[["max_pooling2d_8", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_2", "inbound_nodes": [[["fourth_conv", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 4096, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["flatten_2", 0, 0, {}]]]}], "input_layers": [["input_image", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "name": "embedding", "inbound_nodes": [[["input_img", 0, 0, {}]], [["validation_img", 0, 0, {}]]]}, {"class_name": "L1Dist", "config": {"name": "distance", "trainable": true, "dtype": "float32"}, "name": "distance", "inbound_nodes": [[["embedding", 1, 0, {"validation_embedding": ["embedding", 2, 0]}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["distance", 0, 0, {}]]]}], "input_layers": [["input_img", 0, 0], ["validation_img", 0, 0]], "output_layers": [["dense_3", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of38.bin", "group1-shard2of38.bin", "group1-shard3of38.bin", "group1-shard4of38.bin", "group1-shard5of38.bin", "group1-shard6of38.bin", "group1-shard7of38.bin", "group1-shard8of38.bin", "group1-shard9of38.bin", "group1-shard10of38.bin", "group1-shard11of38.bin", "group1-shard12of38.bin", "group1-shard13of38.bin", "group1-shard14of38.bin", "group1-shard15of38.bin", "group1-shard16of38.bin", "group1-shard17of38.bin", "group1-shard18of38.bin", "group1-shard19of38.bin", "group1-shard20of38.bin", "group1-shard21of38.bin", "group1-shard22of38.bin", "group1-shard23of38.bin", "group1-shard24of38.bin", "group1-shard25of38.bin", "group1-shard26of38.bin", "group1-shard27of38.bin", "group1-shard28of38.bin", "group1-shard29of38.bin", "group1-shard30of38.bin", "group1-shard31of38.bin", "group1-shard32of38.bin", "group1-shard33of38.bin", "group1-shard34of38.bin", "group1-shard35of38.bin", "group1-shard36of38.bin", "group1-shard37of38.bin", "group1-shard38of38.bin"], "weights": [{"name": "dense_3/kernel", "shape": [4096, 1], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [1], "dtype": "float32"}, {"name": "first_conv/kernel", "shape": [10, 10, 3, 64], "dtype": "float32"}, {"name": "first_conv/bias", "shape": [64], "dtype": "float32"}, {"name": "second_conv/kernel", "shape": [7, 7, 64, 128], "dtype": "float32"}, {"name": "second_conv/bias", "shape": [128], "dtype": "float32"}, {"name": "third_conv/kernel", "shape": [4, 4, 128, 128], "dtype": "float32"}, {"name": "third_conv/bias", "shape": [128], "dtype": "float32"}, {"name": "fourth_conv/kernel", "shape": [4, 4, 128, 256], "dtype": "float32"}, {"name": "fourth_conv/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [9216, 4096], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [4096], "dtype": "float32"}]}]}